# LayerElemCompoundElemType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LayerElemCompoundElemType Property
ParameterTypeId Class See Also
---
"Compound Element Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LayerElemCompoundElemType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LayerElemCompoundElemType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LayerElemCompoundElemType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace